src/Конфигурация/Documents/УстановкаОкладовСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>УстановкаОкладовСотрудников</Name>
			<BasedOn>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОкладыСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Оклады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оклад</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Конфигурация/Documents/УстановкаОкладовСотрудников/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьДанныеВыбора(Данные, ВыбранноеЗначение)
	Модифицированность = Истина;
	Данные.Сотрудник = ВыбранноеЗначение.Сотрудник;
	Данные.Должность = ВыбранноеЗначение.Должность;
	Данные.Оклад = ВыбранноеЗначение.Оклад;
КонецПроцедуры

&НаКлиенте
Процедура ОкладыСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИнтерактивныеОперацииКлиент.ОткрытьФормуВыбораСотрудника(
		  Элементы.Оклады.ТекущиеДанные
		, Элемент
		, Новый Структура("Период,Должность", Объект.Дата)
	);
КонецПроцедуры
&НаКлиенте
Процедура ОкладыСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Элемент.СписокВыбора.Очистить();
		Элемент.СписокВыбора.Добавить(ВыбранноеЗначение.Сотрудник);
		Данные = Элементы.Оклады.ТекущиеДанные;
		УстановитьДанныеВыбора(Данные, ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОкладыДолжностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИнтерактивныеОперацииКлиент.ОткрытьФормуВыбораСотрудника(
		  Элементы.Оклады.ТекущиеДанные
		, Элемент
		, Новый Структура("Период,Сотрудник", Объект.Дата)
	);
КонецПроцедуры
&НаКлиенте
Процедура ОкладыДолжностьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Элемент.СписокВыбора.Очистить();
		Элемент.СписокВыбора.Добавить(ВыбранноеЗначение.Должность);
		Данные = Элементы.Оклады.ТекущиеДанные;
		УстановитьДанныеВыбора(Данные, ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры
